src/cfe/КСП/Documents/КСП_УстановкаИдентификаторовТоваровДляПоказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_УстановкаИдентификаторовТоваровДляПоказа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КСП_ИдентификаторыТоваровДляПоказа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Идентификаторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/КСП_ИдентификаторыТоваровДляПоказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_ИдентификаторыТоваровДляПоказа</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзмерениеКоллекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_УстановкаИдентификаторовТоваровДляПоказа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьИмеющиесяИдентификаторы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КСП_ИдентификаторыТоваровДляПоказа.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.КСП_ИдентификаторыТоваровДляПоказа КАК КСП_ИдентификаторыТоваровДляПоказа
		|
		|СГРУППИРОВАТЬ ПО
		|	КСП_ИдентификаторыТоваровДляПоказа.Идентификатор";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Идентификатор");
	
	возврат РезультатЗапроса;
	
КонецФункции

&НаКлиенте
Процедура СформироватьИдентификаторы(Команда)
	МассивИмеющихсяИдентификаторов = ПолучитьИмеющиесяИдентификаторы();
	ГЕН = Новый ГенераторСлучайныхЧисел();
	Для каждого текСтрока Из Объект.Идентификаторы Цикл
		Если НЕ ЗначениеЗаполнено(текСтрока.Идентификатор) И ЗначениеЗаполнено(текСтрока.Номенклатура) Тогда
			Число1 = ГЕН.СлучайноеЧисло(0, 4000000000);
			Число2 = ГЕН.СлучайноеЧисло(0, 3000000000);
			Число3 = ГЕН.СлучайноеЧисло(0, 2999999999);
			текСтрока.Идентификатор = Число1 + Число2 + Число3;
			Пока МассивИмеющихсяИдентификаторов.Найти(текСтрока.Идентификатор) <> Неопределено Цикл
				текСтрока.Идентификатор = ГЕН.СлучайноеЧисло(0, 9999999999);
			КонецЦикла;
			МассивИмеющихсяИдентификаторов.Добавить(текСтрока.Идентификатор);
		КонецЕсли;
	КонецЦикла
КонецПроцедуры
